Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX128T255OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX256T511OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX256T511OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX256T511OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_OFF (14u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX512T1023OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX512T1023OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX512T1023OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_OFF (15u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUCGPIS_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLENERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLENERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLENERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLENERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLENERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLENERPIS_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXORANGEPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXORANGEPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXORANGEPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXORANGEPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXORANGEPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXORANGEPIS_OFF (19u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXPAUSPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXPAUSPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXPAUSPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXPAUSPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXPAUSPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXPAUSPIS_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXFOVPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXFOVPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXFOVPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXFOVPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXFOVPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXFOVPIS_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXVLANGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXVLANGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXVLANGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXVLANGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXVLANGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXVLANGBPIS_OFF (22u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXWDOGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXWDOGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXWDOGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXWDOGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXWDOGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXWDOGPIS_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRCVERRPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRCVERRPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRCVERRPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRCVERRPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRCVERRPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRCVERRPIS_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCTRLPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCTRLPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCTRLPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCTRLPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCTRLPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCTRLPIS_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPIUSCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPIUSCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPIUSCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPIUSCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPIUSCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPIUSCIS_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPITRCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPITRCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPITRCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPITRCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPITRCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPITRCIS_OFF (27u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBOCTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBOCTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBOCTIS_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBPKTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBPKTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBPKTIS_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGPIS_OFF (2u)

