Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_Bits.TSEC */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Bits.TSICSNS */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Bits.TSICSNS */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Bits.TSICSNS */
#define IFX_GETH_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Bits.TSECSNS */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Bits.TSECSNS */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Bits.TSECSNS */
#define IFX_GETH_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_GETH_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_GETH_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_GETH_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_GETH_MAC_PPS_CONTROL_PPSEN0_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_GETH_MAC_PPS_CONTROL_PPSEN0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_GETH_MAC_PPS_CONTROL_PPSEN0_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_GETH_MAC_PPS_CONTROL_TRGTMODSEL0_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_GETH_MAC_PPS_CONTROL_TRGTMODSEL0_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_GETH_MAC_PPS_CONTROL_TRGTMODSEL0_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_PPS0_TARGET_TIME_SECONDS_Bits.TSTRH0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_PPS0_TARGET_TIME_SECONDS_Bits.TSTRH0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_PPS0_TARGET_TIME_SECONDS_Bits.TSTRH0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_Bits.TTSL0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_LEN (31u)

/** \brief Mask for Ifx_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_Bits.TTSL0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_MSK (0x7fffffffu)

/** \brief Offset for Ifx_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_Bits.TTSL0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_TRGTBUSY0_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_TRGTBUSY0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY0 */
#define IFX_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS_TRGTBUSY0_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_PPS0_INTERVAL_Bits.PPSINT0 */
#define IFX_GETH_MAC_PPS0_INTERVAL_PPSINT0_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_PPS0_INTERVAL_Bits.PPSINT0 */
#define IFX_GETH_MAC_PPS0_INTERVAL_PPSINT0_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_PPS0_INTERVAL_Bits.PPSINT0 */
#define IFX_GETH_MAC_PPS0_INTERVAL_PPSINT0_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PPS0_WIDTH_Bits.PPSWIDTH0 */
#define IFX_GETH_MAC_PPS0_WIDTH_PPSWIDTH0_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_PPS0_WIDTH_Bits.PPSWIDTH0 */
#define IFX_GETH_MAC_PPS0_WIDTH_PPSWIDTH0_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_PPS0_WIDTH_Bits.PPSWIDTH0 */
#define IFX_GETH_MAC_PPS0_WIDTH_PPSWIDTH0_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_OPERATION_MODE_Bits.DTXSTS */
#define IFX_GETH_MTL_OPERATION_MODE_DTXSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_OPERATION_MODE_Bits.DTXSTS */
#define IFX_GETH_MTL_OPERATION_MODE_DTXSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_OPERATION_MODE_Bits.DTXSTS */
#define IFX_GETH_MTL_OPERATION_MODE_DTXSTS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_OPERATION_MODE_Bits.RAA */
#define IFX_GETH_MTL_OPERATION_MODE_RAA_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_OPERATION_MODE_Bits.RAA */
#define IFX_GETH_MTL_OPERATION_MODE_RAA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_OPERATION_MODE_Bits.RAA */
#define IFX_GETH_MTL_OPERATION_MODE_RAA_OFF (2u)

/** \brief Length for Ifx_GETH_MTL_OPERATION_MODE_Bits.SCHALG */
#define IFX_GETH_MTL_OPERATION_MODE_SCHALG_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_OPERATION_MODE_Bits.SCHALG */
#define IFX_GETH_MTL_OPERATION_MODE_SCHALG_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_OPERATION_MODE_Bits.SCHALG */
#define IFX_GETH_MTL_OPERATION_MODE_SCHALG_OFF (5u)

/** \brief Length for Ifx_GETH_MTL_OPERATION_MODE_Bits.CNTPRST */
#define IFX_GETH_MTL_OPERATION_MODE_CNTPRST_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_OPERATION_MODE_Bits.CNTPRST */
#define IFX_GETH_MTL_OPERATION_MODE_CNTPRST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_OPERATION_MODE_Bits.CNTPRST */
#define IFX_GETH_MTL_OPERATION_MODE_CNTPRST_OFF (8u)

/** \brief Length for Ifx_GETH_MTL_OPERATION_MODE_Bits.CNTCLR */
#define IFX_GETH_MTL_OPERATION_MODE_CNTCLR_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_OPERATION_MODE_Bits.CNTCLR */
#define IFX_GETH_MTL_OPERATION_MODE_CNTCLR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_OPERATION_MODE_Bits.CNTCLR */
#define IFX_GETH_MTL_OPERATION_MODE_CNTCLR_OFF (9u)

/** \brief Length for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q0IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q0IS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q0IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q0IS_MSK (0x1u)

