Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MTL_TXQ0_UNDERFLOW_Bits.UFFRMCNT */
#define IFX_GETH_MTL_TXQ0_UNDERFLOW_UFFRMCNT_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_UNDERFLOW_Bits.UFCNTOVF */
#define IFX_GETH_MTL_TXQ0_UNDERFLOW_UFCNTOVF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_UNDERFLOW_Bits.UFCNTOVF */
#define IFX_GETH_MTL_TXQ0_UNDERFLOW_UFCNTOVF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_UNDERFLOW_Bits.UFCNTOVF */
#define IFX_GETH_MTL_TXQ0_UNDERFLOW_UFCNTOVF_OFF (11u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXQPAUSED */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXQPAUSED_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXQPAUSED */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXQPAUSED_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXQPAUSED */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXQPAUSED_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TRCSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TRCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TRCSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TRCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TRCSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TRCSTS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TWCSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TWCSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TWCSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TWCSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TWCSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TWCSTS_OFF (3u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXQSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXQSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXQSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXQSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXQSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXQSTS_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXSTSFSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXSTSFSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXSTSFSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXSTSFSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.TXSTSFSTS */
#define IFX_GETH_MTL_TXQ0_DEBUG_TXSTSFSTS_OFF (5u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.PTXQ */
#define IFX_GETH_MTL_TXQ0_DEBUG_PTXQ_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.PTXQ */
#define IFX_GETH_MTL_TXQ0_DEBUG_PTXQ_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.PTXQ */
#define IFX_GETH_MTL_TXQ0_DEBUG_PTXQ_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.STXSTSF */
#define IFX_GETH_MTL_TXQ0_DEBUG_STXSTSF_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.STXSTSF */
#define IFX_GETH_MTL_TXQ0_DEBUG_STXSTSF_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_DEBUG_Bits.STXSTSF */
#define IFX_GETH_MTL_TXQ0_DEBUG_STXSTSF_OFF (20u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_ETS_STATUS_Bits.ABS */
#define IFX_GETH_MTL_TXQ0_ETS_STATUS_ABS_LEN (24u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_ETS_STATUS_Bits.ABS */
#define IFX_GETH_MTL_TXQ0_ETS_STATUS_ABS_MSK (0xffffffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_ETS_STATUS_Bits.ABS */
#define IFX_GETH_MTL_TXQ0_ETS_STATUS_ABS_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_QUANTUM_WEIGHT_Bits.ISCQW */
#define IFX_GETH_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_LEN (21u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_QUANTUM_WEIGHT_Bits.ISCQW */
#define IFX_GETH_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_MSK (0x1fffffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_QUANTUM_WEIGHT_Bits.ISCQW */
#define IFX_GETH_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.TXUNFIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.TXUNFIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.TXUNFIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.ABPSIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.ABPSIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.ABPSIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.TXUIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.TXUIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.TXUIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_OFF (8u)

/** \brief Length for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.ABPSIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.ABPSIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.ABPSIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_OFF (9u)

/** \brief Length for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.RXOVFIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.RXOVFIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.RXOVFIS */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.RXOIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.RXOIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_Bits.RXOIE */
#define IFX_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_OFF (24u)

